app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date
---
  def index
    #Part 1
    if params.key?(:sort_by)
      session[:sort_by] = params[:sort_by]
    elsif session.key?(:sort_by)
      params[:sort_by] = session[:sort_by]
      redirect_to movies_path(params)
      return
    end
    @hilite = sort_by = session[:sort_by]

    #Part 2
    @all_ratings = Movie.all_ratings
    if params.key?(:ratings)
      session[:ratings] = params[:ratings]
    elsif session.key?(:ratings)
      params[:ratings] = session[:ratings]
      redirect_to movies_path(params)
      return
    end

    @ratings = (session[:ratings].keys if session.key?(:ratings)) || @all_ratings

    @movies = Movie.order(sort_by).where(rating: @ratings)